{
  "title": "How to Check Your Dog's Eyes",
  "profile": "Owning a dog is a huge responsibility. Unlike a human, a dog cannot really tell us when something is bothering them. Therefore, it is important to examine your dog regularly, which includes spending time examining its eyes to make sure that they haven't developed an infection, and that there are no debris present. Furthermore, checking your dog's eyes could help you catch a more serious disease before it causes huge problems for your dog. Take good care of your dog and their eyes and you will have a happy dog who can offer you unconditional love and companionship.",
  "steps": [
    {
      "title": "Examining Your Dog's Eyes",
      "step_items": [
        {
          "content": "Take your dog to a well-lit area. Have your dog come to you in an area where there is a lot of light, this will allow you to notice anything unusual about your dog's eyes that you might not see in a darker location. X Research source Be sure to pet your dog and use a soothing voice in order to reassure them that nothing is wrong. WH.performance.mark('step1_rendered');",
          "children": [
            "Be sure to pet your dog and use a soothing voice in order to reassure them that nothing is wrong."
          ],
          "img": "https://www.wikihow.com/images/thumb/e/e3/Check-Your-Dog%27s-Eyes-Step-1-Version-3.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-1-Version-3.jpg"
        },
        {
          "content": "Ask your dog to sit and stay. If your dog knows the commands “sit” and “stay”, have your dog do this so you can examine them without having them squirming around or trying to play while you examine them. Consider giving them a treat to reward them for their good behavior.",
          "children": [
            "Consider giving them a treat to reward them for their good behavior."
          ],
          "img": "https://www.wikihow.com/images/thumb/9/97/Check-Your-Dog%27s-Eyes-Step-2-Version-3.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-2-Version-3.jpg"
        },
        {
          "content": "Look into your dog's eyes. You can hold your dog's head gently in your hands. Look into each eye carefully to look for signs of infection, debris, or disease. Be sure to check both eyes thoroughly for any signs of illness as well as foreign objects such as grass or dirt. X Research source You should look for crustiness, discharge, or teariness from the eyeball. X Expert Source Jamie Freyer, DVMLicensed Veterinarian Expert Interview. 7 December 2021. Make sure that the eyeball also has a white area around it that looks healthy and free from redness. Look at the pupils and make sure they are the same size. Check that the eyes do not seem cloudy or otherwise irritated. You should also check for to see that the third eyelid (the eyelid that is typically not visible, but present in order to keep dirt and debris out of the eyes) is not visible. If you notice a whitish colored membrane that makes it look a bit like your dog's eye is rolling back, then you are probably seeing the third eyelid.",
          "children": [
            "You should look for crustiness, discharge, or teariness from the eyeball.[3]\n\tX\n\t\tExpert Source\n\n\t\t\n\t\t\tJamie Freyer, DVMLicensed Veterinarian\n\n\t\tExpert Interview.  7 December 2021.\n\n\n Make sure that the eyeball also has a white area around it that looks healthy and free from redness.",
            "Look at the pupils and make sure they are the same size. Check that the eyes do not seem cloudy or otherwise irritated. You should also check for to see that the third eyelid (the eyelid that is typically not visible, but present in order to keep dirt and debris out of the eyes) is not visible. If you notice a whitish colored membrane that makes it look a bit like your dog's eye is rolling back, then you are probably seeing the third eyelid."
          ],
          "img": "https://www.wikihow.com/images/thumb/9/93/Check-Your-Dog%27s-Eyes-Step-3-Version-3.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-3-Version-3.jpg"
        },
        {
          "content": "Check the lining of your dog's eyes. Just like us, dogs have eyelids that protect the eye. This means that a large part of the eyeball is not visible without rolling the eyelid down. Do this very gently using your fingers. Check to make sure that the eye is not red and that the lining of the eye looks healthy (e.g. no irritation, cuts, or debris). Wash your hands before touching your dogs eyelids as you may introduce bacteria or other germs into your dog's eye, which may lead to infection. Be sure to look at both the top and bottom lids.",
          "children": [
            "Wash your hands before touching your dogs eyelids as you may introduce bacteria or other germs into your dog's eye, which may lead to infection.",
            "Be sure to look at both the top and bottom lids."
          ],
          "img": "https://www.wikihow.com/images/thumb/0/0b/Check-Your-Dog%27s-Eyes-Step-4-Version-2.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-4-Version-2.jpg"
        },
        {
          "content": "Check your dog's menace reflex. You should also make sure that your dog is not having trouble seeing by testing the menace reflex. You can do this by holding your hand open so that the palm of your hand faces your dog. Hold your hand about 18 inches (46 cm) from your dog's face and then quickly move your palm so that it comes to about 3 inches (8 cm) from their face. If your dog is not having vision issues, they will blink. X Research source If your dog does not react to this test, it is an indication that your dog cannot see well or at all. You can repeat this test in the other eye to see if there is a problem with each individual eye. Be careful not to hit your dog when doing this test.",
          "children": [
            "If your dog does not react to this test, it is an indication that your dog cannot see well or at all.",
            "You can repeat this test in the other eye to see if there is a problem with each individual eye.",
            "Be careful not to hit your dog when doing this test."
          ],
          "img": "https://www.wikihow.com/images/thumb/5/57/Check-Your-Dog%27s-Eyes-Step-5-Version-3.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-5-Version-3.jpg"
        },
        {
          "content": "Understand the symptoms. There are many different ailments that can affect your dog's eyes. Some are serious and some are not, but it's best to take any concerns to your vet, as leaving them left untreated may create big problems for your dog. A visible third eyelid could indicate that your dog has a fever, which means they may be very ill with something serious. X Research source Bloodshot eyes are also an indication of illness. If you notice redness in one or both of your dog's eyes, they may be ill, they may have come in contact with some type of irritant, or they may have some type of infection. X Expert Source Jamie Freyer, DVMLicensed Veterinarian Expert Interview. 7 December 2021. Cloudiness may be an indication of cataracts, which is a relatively common condition in dogs. X Trustworthy Source Washington State University College of Veterinary Medicine Leading veterinary medicine training institution and biomedical research center Go to source Although some breeds have naturally bulgy eyeballs, if your dog starts to develop bulgy eyes when they did not have them before, it could be a sign of glaucoma. X Research source If you notice that your dog's eyelids seem to roll inward, it could signal a condition called “entropion”, which can cause damage to the eyes as the eyelids rub against the eyeball. A lot of discharge, irritation, and redness may be a sign of an eye infection.",
          "children": [
            "A visible third eyelid could indicate that your dog has a fever, which means they may be very ill with something serious.[5]\n\tX\n\t\tResearch source",
            "Bloodshot eyes are also an indication of illness. If you notice redness in one or both of your dog's eyes, they may be ill, they may have come in contact with some type of irritant, or they may have some type of infection.[6]\n\tX\n\t\tExpert Source\n\n\t\t\n\t\t\tJamie Freyer, DVMLicensed Veterinarian\n\n\t\tExpert Interview.  7 December 2021.",
            "Cloudiness may be an indication of cataracts, which is a relatively common condition in dogs.[7]\n\tX\n\t\tTrustworthy Source\n\n\t\tWashington State University College of Veterinary Medicine\n\t\tLeading veterinary medicine training institution and biomedical research center\n\n\t\t\t\tGo to source",
            "Although some breeds have naturally bulgy eyeballs, if your dog starts to develop bulgy eyes when they did not have them before, it could be a sign of glaucoma.[8]\n\tX\n\t\tResearch source",
            "If you notice that your dog's eyelids seem to roll inward, it could signal a condition called “entropion”, which can cause damage to the eyes as the eyelids rub against the eyeball.",
            "A lot of discharge, irritation, and redness may be a sign of an eye infection."
          ],
          "img": "https://www.wikihow.com/images/thumb/1/1a/Check-Your-Dog%27s-Eyes-Step-6-Version-3.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-6-Version-3.jpg"
        }
      ]
    },
    {
      "title": "Caring for Your Dog's Eyes",
      "step_items": [
        {
          "content": "Clean your dog's eyes regularly. All you have to do to keep your dog's eyes clean is to wet a cotton ball or soft cloth with fresh, clean water, and gently wipe away any crustiness or other debris you notice around the eye. Start at the inside corner of the eye and wipe outwards away from the eye. X Research source Wipe very gently so you don't scratch your dog's eyeball. If your dog suffers from dry eyes, ask your vet about a dog eye wash.",
          "children": [
            "Wipe very gently so you don't scratch your dog's eyeball.",
            "If your dog suffers from dry eyes, ask your vet about a dog eye wash."
          ],
          "img": "https://www.wikihow.com/images/thumb/5/5c/Check-Your-Dog%27s-Eyes-Step-7-Version-2.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-7-Version-2.jpg"
        },
        {
          "content": "Trim the hair around your dog's eyes. Not only will long hair around your dog's eyes make it difficult for them to see, this long hair may also poke or scratch the eyeballs, causing irritation, infection, or even blindness. Make sure to trim the hair around your dog's eyes to protect them from this problem. X Research source You can groom your dog at home by yourself, or you can take your dog to a professional groomer. Be careful using scissors around your dog's eyes. If you are afraid to trim the hair around your dog's eyes, it's best to have a groomer do it a few times. Ask them if they can show you how to trim this hair safely.",
          "children": [
            "You can groom your dog at home by yourself, or you can take your dog to a professional groomer.",
            "Be careful using scissors around your dog's eyes. If you are afraid to trim the hair around your dog's eyes, it's best to have a groomer do it a few times. Ask them if they can show you how to trim this hair safely."
          ],
          "img": "https://www.wikihow.com/images/thumb/7/77/Check-Your-Dog%27s-Eyes-Step-8-Version-2.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-8-Version-2.jpg"
        },
        {
          "content": "Check your dog's eyes regularly and see a vet if you notice anything unusual. It is a good idea to check your dog's eyes regularly, for example, any time you do your dog's regular grooming or at least once a month. If you do notice anything unusual, it's best to at least give your vet a call to see if it's worth bringing your dog in for an exam. X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Some breeds are more pre-disposed to eye problems than others. Ask your vet if your dog's breed is known to have any common eye problems that you should look out for. A few breeds that are known to be pre-disposed to various problems with the eyes include: Pugs, Shih Tzus, Bulldogs, Sheepdogs, Poodles, and Maltese. X Research source",
          "children": [
            "Some breeds are more pre-disposed to eye problems than others. Ask your vet if your dog's breed is known to have any common eye problems that you should look out for.",
            "A few breeds that are known to be pre-disposed to various problems with the eyes include: Pugs, Shih Tzus, Bulldogs, Sheepdogs, Poodles, and Maltese.[12]\n\tX\n\t\tResearch source"
          ],
          "img": "https://www.wikihow.com/images/thumb/d/da/Check-Your-Dog%27s-Eyes-Step-9-Version-2.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-9-Version-2.jpg"
        },
        {
          "content": "Don't let a dog hang its head out of the window in the car. Though your dog may love sticking their head out the window in the car, there is a good chance that a bug, a piece of dirt, or some other debris might fly into your dogs eyes causing irritation or even a more serious injury. Therefore, when in the car, you should keep the windows rolled up so your dog can't stick their head out. You may feel sad doing this, especially if you know your dog really loves it, but try to remember that you are only doing what is best for them. You can roll the windows down partially, but make sure that your dog can't put their head out the window.",
          "children": [
            "You may feel sad doing this, especially if you know your dog really loves it, but try to remember that you are only doing what is best for them.",
            "You can roll the windows down partially, but make sure that your dog can't put their head out the window."
          ],
          "img": "https://www.wikihow.com/images/thumb/c/cb/Check-Your-Dog%27s-Eyes-Step-10-Version-2.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-10-Version-2.jpg"
        }
      ]
    },
    {
      "title": "Visiting the Vet",
      "step_items": [
        {
          "content": "Take your dog to the vet. If you notice anything unusual about your dog's eyes it is wise to take them to the vet as soon as possible. X Research source Some conditions can progress quickly and, if left untreated, can cause irreversible blindness. X Expert Source Jamie Freyer, DVMLicensed Veterinarian Expert Interview. 7 December 2021. Your vet knows what signs and symptoms to look for, and has the right equipment to diagnose the problem correctly. There is no reason to risk your dog's eyesight. If you are worried about the cost of visiting the vet, ask them if you can arrange a payment plan. Most vets will happily work something out with you.",
          "children": [
            "Your vet knows what signs and symptoms to look for, and has the right equipment to diagnose the problem correctly. There is no reason to risk your dog's eyesight.",
            "If you are worried about the cost of visiting the vet, ask them if you can arrange a payment plan. Most vets will happily work something out with you."
          ],
          "img": "https://www.wikihow.com/images/thumb/3/3e/Check-Your-Dog%27s-Eyes-Step-11-Version-2.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-11-Version-2.jpg"
        },
        {
          "content": "Avoid putting anything in your dog's eye without consulting a vet. If your dog has had a chronic eye problem in the past, you may have a bottle of medication used to treat that condition in your medicine cabinet. However, if you notice that your dog is pawing at their eyes or if you suspect that the problem is occurring again, don't just reach for the medicine. First, give your vet a call to see what they say. X Research source If you medicate your dog without first consulting a vet, you run the risk of exacerbating the problem. The medication you give them could even cause them to go blind.",
          "children": [
            "If you medicate your dog without first consulting a vet, you run the risk of exacerbating the problem. The medication you give them could even cause them to go blind."
          ],
          "img": "https://www.wikihow.com/images/thumb/8/89/Check-Your-Dog%27s-Eyes-Step-12-Version-2.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-12-Version-2.jpg"
        },
        {
          "content": "Give a clear account of the symptoms. Explain to your doctor why you brought the dog in, and when you started to notice symptoms. Be clear and concise. Explain whether you noticed something off when you were giving your dog a routine check or whether your dog has been pawing at his eyes. This will help your vet determine the diagnosis as well as the best course of treatment. If you have done anything to treat your dog's eyes, be sure to tell your vet. If you have a suspicion about what could be causing your dog's eye problem, tell your vet about it. For example, tell the vet if you recently took your dog to a heavily wooded area and suspect that your dog may have gotten poked in the eye by some brush or attacked by an animal.",
          "children": [
            "This will help your vet determine the diagnosis as well as the best course of treatment.",
            "If you have done anything to treat your dog's eyes, be sure to tell your vet. If you have a suspicion about what could be causing your dog's eye problem, tell your vet about it. For example, tell the vet if you recently took your dog to a heavily wooded area and suspect that your dog may have gotten poked in the eye by some brush or attacked by an animal."
          ],
          "img": "https://www.wikihow.com/images/thumb/f/f5/Check-Your-Dog%27s-Eyes-Step-13-Version-2.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-13-Version-2.jpg"
        },
        {
          "content": "Get regular check-ups. While you should always be monitoring your dog's health and well-being on your own at home, it is also wise to take your dog into the vet at least once or twice a year to get an exam. If there is something wrong with your dog, a regular examination will increase the chance that the problem will be caught before it is too late. X Research source Most states in the US have laws about keeping your dog vaccinated against rabies. Getting yearly exams will not only prevent many health-related issues, it will also ensure that your dog's vaccines are always current.",
          "children": [
            "Most states in the US have laws about keeping your dog vaccinated against rabies. Getting yearly exams will not only prevent many health-related issues, it will also ensure that your dog's vaccines are always current."
          ],
          "img": "https://www.wikihow.com/images/thumb/3/3e/Check-Your-Dog%27s-Eyes-Step-14-Version-2.jpg/v4-460px-Check-Your-Dog%27s-Eyes-Step-14-Version-2.jpg"
        }
      ]
    }
  ],
  "url": "https://www.wikihow.pet/Check-Your-Dog%27s-Eyes",
  "source": {
    "url": "https://www.wikihow.pet/Check-Your-Dog%27s-Eyes",
    "template_id": "493da9bf-a6d3-405c-b026-bec203fb2b9c",
    "template_name": "WikiHow Article",
    "scraped_at": "2025-02-20T03:20:29.331Z"
  },
  "id": "07fa4d0d-99ad-4f42-b8b4-7adcc843bc02",
  "slug": "how-to-check-your-dog-s-eyes",
  "created_at": "2025-02-20T03:20:29.331Z",
  "updated_at": "2025-02-20T03:20:29.331Z"
}