{
  "title": "How to Treat Dog Conjunctivitis",
  "profile": "Conjunctivitis is an irritating but treatable eye condition that many dogs get. If your dog has conjunctivitis, also called pink eye, it’s important to treat it quickly so that it doesn’t spread to other pets and so that your dog’s pain and discomfort is eased. To treat conjunctivitis, you need to make your dog as comfortable as possible and get it veterinary care. Under the care of a veterinarian and with proper medication, your dog's eyes will be back to normal quickly.",
  "steps": [
    {
      "title": "Caring for Conjunctivitis at Home",
      "step_items": [
        {
          "content": "Stop your dog from scratching its eyes. After you discover that your dog has conjunctivitis it’s important to prevent the animal from causing additional damage. Your dog is likely to try and paw at its eyes in order to ease the discomfort, but you can’t let it do this. The easiest way to prevent scratching at the eyes is to put an Elizabethan cone on the dog.  X Research source If you do put a cone on your dog, you will need to take it off to let the dog eat and drink. Keep an eye on your dog during these times in order to prevent it from scratching while the cone is off. WH.performance.mark('step1_rendered');",
          "children": [
            "If you do put a cone on your dog, you will need to take it off to let the dog eat and drink. Keep an eye on your dog during these times in order to prevent it from scratching while the cone is off."
          ],
          "img": "https://www.wikihow.com/images/thumb/e/e4/Treat-Dog-Conjunctivitis-Step-1.jpg/v4-460px-Treat-Dog-Conjunctivitis-Step-1.jpg"
        },
        {
          "content": "Isolate your infected dog. If you have more than one pet, it’s important that you keep the dog with conjunctivitis away from the others. This can be a contagious condition that can easily transfer from pet to pet, depending on its underlying cause. X Research source While many cases of conjunctivitis in dogs are not actually contagious, some are and you won’t know what type your dog has until it is diagnosed, so it’s better to be safe than sorry. Even if you don’t have other pets, it’s important that you are cautious about exposing other animals to your dog’s illness. Keep the dog inside or in your own yard as much as possible and don’t take your dog places where dogs congregate, such as a dog park.",
          "children": [
            "While many cases of conjunctivitis in dogs are not actually contagious, some are and you won’t know what type your dog has until it is diagnosed, so it’s better to be safe than sorry.",
            "Even if you don’t have other pets, it’s important that you are cautious about exposing other animals to your dog’s illness. Keep the dog inside or in your own yard as much as possible and don’t take your dog places where dogs congregate, such as a dog park."
          ],
          "img": "https://www.wikihow.com/images/thumb/e/ea/Treat-Dog-Conjunctivitis-Step-2.jpg/v4-460px-Treat-Dog-Conjunctivitis-Step-2.jpg"
        },
        {
          "content": "Keep your dog as comfortable as possible. Conjunctivitis can be a very uncomfortable condition for your dog, so try to make it feel as good as possible while it has this illness. Make sure your dog has a comfortable place to lie down and give it lots of love and attention while you treat its condition. One thing that can be soothing to a dog with conjunctivitis is to remove any discharge around the eyes with a warm washcloth. Lightly wipe the fur around the eyes, being careful not to touch the eye itself.",
          "children": [
            "One thing that can be soothing to a dog with conjunctivitis is to remove any discharge around the eyes with a warm washcloth. Lightly wipe the fur around the eyes, being careful not to touch the eye itself."
          ],
          "img": "https://www.wikihow.com/images/thumb/7/79/Treat-Dog-Conjunctivitis-Step-3.jpg/v4-460px-Treat-Dog-Conjunctivitis-Step-3.jpg"
        },
        {
          "content": "Call your veterinarian for advice. If you have identified the symptoms of conjunctivitis in your dog and they have not gone away after a day or 2, you should contact your veterinary office. Tell them about the symptoms your dog is having and discuss whether you need to bring it in to be looked at. X Research source Depending on your dog's medical history, your veterinarian may suggest a variety of options. These may include bringing the dog in right away, waiting a few days to see if the condition clears up, or giving simple preliminary treatments at home, such as putting saline drops in the dog's eyes to clean them out.",
          "children": [
            "Depending on your dog's medical history, your veterinarian may suggest a variety of options. These may include bringing the dog in right away, waiting a few days to see if the condition clears up, or giving simple preliminary treatments at home, such as putting saline drops in the dog's eyes to clean them out."
          ],
          "img": "https://www.wikihow.com/images/thumb/7/7b/Treat-Dog-Conjunctivitis-Step-4.jpg/v4-460px-Treat-Dog-Conjunctivitis-Step-4.jpg"
        }
      ]
    },
    {
      "title": "Getting Veterinary Treatment",
      "step_items": [
        {
          "content": "Get a diagnosis. If your veterinarian suggests that you should bring your dog in, the first thing they will do is assess the problem. Tell them about your dog’s symptoms, including how long your dog has been experiencing them. After that, your veterinarian will do a physical examination of the dog, including testing the dog’s eye pressure and looking at its internal eye structures. X Research source Your veterinarian is likely to do a full physical exam when you bring it in. This will help them determine if there is an underlying health problem that is causing the conjunctivitis. Your veterinarian is also likely to run a variety of diagnostic tests while determining their diagnosis. This may include a full blood panel and tests for specific illnesses that commonly cause conjunctivitis.",
          "children": [
            "Your veterinarian is likely to do a full physical exam when you bring it in. This will help them determine if there is an underlying health problem that is causing the conjunctivitis.",
            "Your veterinarian is also likely to run a variety of diagnostic tests while determining their diagnosis. This may include a full blood panel and tests for specific illnesses that commonly cause conjunctivitis."
          ],
          "img": "https://www.wikihow.com/images/thumb/5/50/Treat-Dog-Conjunctivitis-Step-5.jpg/v4-460px-Treat-Dog-Conjunctivitis-Step-5.jpg"
        },
        {
          "content": "Determine if there are any related health problems. Conjunctivitis can be caused by other illness and it can cause damage to the eye. For instance, conjunctivitis can be a side effect of bacterial infections, dry eyes, problems with eye pressure due to glaucoma, or viral infections. Because of this, it is important for your veterinarian to do a thorough examination of the eye to ensure that it is healthy other than the conjunctivitis. X Research source The veterinarian will look closely at your dog’s eyes, including examining its eyelids, eyelids, and all other eye structures. They may also run diagnostic tests that they feel are necessary. X Research source",
          "children": [
            "The veterinarian will look closely at your dog’s eyes, including examining its eyelids, eyelids, and all other eye structures. They may also run diagnostic tests that they feel are necessary.[6]\n\tX\n\t\tResearch source"
          ],
          "img": "https://www.wikihow.com/images/thumb/2/25/Treat-Dog-Conjunctivitis-Step-6.jpg/v4-460px-Treat-Dog-Conjunctivitis-Step-6.jpg"
        },
        {
          "content": "Follow your veterinarian’s suggestions for treatment. In most cases, your veterinarian will prescribe your dog a medicated, anti-inflammatory ointment or drops that need to be applied to the eyes. However, if your dog also has other eye problems, you may also need to give it an antibiotic or another medication in addition. X Research source Follow your veterinarian’s suggestions for how often and how long to give your dog its medication. Even if your dog’s symptoms disappear, it’s important to give the medication for as long as prescribed.",
          "children": [
            "Follow your veterinarian’s suggestions for how often and how long to give your dog its medication. Even if your dog’s symptoms disappear, it’s important to give the medication for as long as prescribed."
          ],
          "img": "https://www.wikihow.com/images/thumb/9/97/Treat-Dog-Conjunctivitis-Step-7.jpg/v4-460px-Treat-Dog-Conjunctivitis-Step-7.jpg"
        },
        {
          "content": "Apply the medication to your dog’s eyes cautiously. In order to get the medication in your dog’s eyes, you will need to get it in a position where you can cradle its head with one arm and apply the medication with the other. If you have a small dog, placing it on a table can do the trick. If you have a large dog, you will need to go down to the dog’s level. X Trustworthy Source Washington State University College of Veterinary Medicine Leading veterinary medicine training institution and biomedical research center Go to source After you apply the drops or ointment, rub the top of the dog’s eyelids when it has its eyes closed. This will help distribute the medication across the whole eye. Keep holding onto the dog while it blinks. This will reduce the chance of the dog trying to paw at its eyes.",
          "children": [
            "After you apply the drops or ointment, rub the top of the dog’s eyelids when it has its eyes closed. This will help distribute the medication across the whole eye.",
            "Keep holding onto the dog while it blinks. This will reduce the chance of the dog trying to paw at its eyes."
          ],
          "img": "https://www.wikihow.com/images/thumb/e/e2/Treat-Dog-Conjunctivitis-Step-8.jpg/v4-460px-Treat-Dog-Conjunctivitis-Step-8.jpg"
        }
      ]
    },
    {
      "title": "Identifying Conjunctivitis",
      "step_items": [
        {
          "content": "Look for redness in the eyes. Many people identify conjunctivitis in their dogs because the dog’s eyes have become unusually red. If you notice that your dog’s eyes are red, continue looking for additional symptoms. X Research source Redness in the eyes alone may not mean that your dog has conjunctivitis. They could just be temporarily irritated or be red due to a different condition.",
          "children": [
            "Redness in the eyes alone may not mean that your dog has conjunctivitis. They could just be temporarily irritated or be red due to a different condition."
          ],
          "img": "https://www.wikihow.com/images/thumb/d/d8/Treat-Dog-Conjunctivitis-Step-9.jpg/v4-460px-Treat-Dog-Conjunctivitis-Step-9.jpg"
        },
        {
          "content": "Inspect your dog’s eyes for discharge. Look around the eye for excessive moisture. This is usually easiest to identify by looking at the fur around the eyes. If it is matted and moist, your dog is probably experiencing discharge from its eyes. Discharge may not be experienced if your dog has conjunctivitis that is caused by keratoconjunctivitis sicca, commonly called dry eye. X Research source",
          "children": [
            "Discharge may not be experienced if your dog has conjunctivitis that is caused by keratoconjunctivitis sicca, commonly called dry eye.[10]\n\tX\n\t\tResearch source"
          ],
          "img": "https://www.wikihow.com/images/thumb/b/be/Treat-Dog-Conjunctivitis-Step-10.jpg/v4-460px-Treat-Dog-Conjunctivitis-Step-10.jpg"
        },
        {
          "content": "Watch for excessive blinking, squinting, or pawing at the eyes. If your dog has irritated eyes, it is likely to try and get rid of the irritation by opening and closing its eyes repeatedly or by pawing at its eyes. X Research source If you see your dog pawing at its eyes, stop that behavior. Put a cone on it so that it can’t damage its eyes further.",
          "children": [
            "If you see your dog pawing at its eyes, stop that behavior. Put a cone on it so that it can’t damage its eyes further."
          ],
          "img": "https://www.wikihow.com/images/thumb/5/51/Treat-Dog-Conjunctivitis-Step-11.jpg/v4-460px-Treat-Dog-Conjunctivitis-Step-11.jpg"
        }
      ]
    }
  ],
  "guide": "点击上方蓝字关注我们",
  "url": "https://www.wikihow.pet/Treat-Dog-Conjunctivitis",
  "source": {
    "url": "https://www.wikihow.pet/Treat-Dog-Conjunctivitis",
    "template_id": "493da9bf-a6d3-405c-b026-bec203fb2b9c",
    "template_name": "WikiHow Article",
    "scraped_at": "2025-02-20T05:32:47.619Z"
  },
  "id": "c5e85b7e-cd50-43b8-b7f5-a7b73d1ac275",
  "slug": "how-to-treat-dog-conjunctivitis",
  "created_at": "2025-02-20T05:32:47.619Z",
  "updated_at": "2025-02-20T05:32:47.619Z"
}